{
  "backend/main.mo": "Main backend actor implementing a social media platform with user profiles, posts, reels, comments, likes, messaging, friend requests, notifications, and access control using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence fixes: ChatPage friend list sidebar display and FeedPage PostCard image rendering, with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing their functionality, state management, backend integration, and UI features for the Fabegram social media application.",
  "frontend/index.html": "HTML entry point for the Fabegram application with favicon, viewport meta tags, and root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile loading states, profile setup modal display logic, and conditional rendering of LoginPage or MainLayout with theme provider and toast notifications.",
  "frontend/src/components/CreatePostDialog.tsx": "Dialog component for creating new posts with image upload, preview, upload progress tracking, optional caption input, and form submission using the useCreatePost hook.",
  "frontend/src/components/CreateReelDialog.tsx": "Dialog component for creating reels with video upload (up to 60 seconds), preview, upload progress tracking, optional caption input, and form submission using the useCreateReel hook.",
  "frontend/src/components/DeleteAccountDialog.tsx": "Alert dialog component for account deletion with confirmation input requiring 'DELETE' text, displays list of data to be permanently removed, and handles async deletion with loading states.",
  "frontend/src/components/EditProfileDialog.tsx": "Dialog component for editing user profile including username, bio, avatar image upload, and privacy toggle (public/private), with form validation and preview functionality.",
  "frontend/src/components/Header.tsx": "Main navigation header with tab switching (feed/reels/chat/profile/friends), notifications popover with mark-as-read functionality, theme toggle, user dropdown menu, and double-click refresh detection for invalidating queries.",
  "frontend/src/components/MainLayout.tsx": "Root layout component managing view state routing between main tabs and detail views (user profiles, chats, posts), handles notification polling display, and coordinates tab navigation with query invalidation.",
  "frontend/src/components/NotificationPopup.tsx": "Toast-style notification popup component with auto-dismiss timer, click handling, and animated slide-in transitions; includes container component for managing multiple notification popups in a stack.",
  "frontend/src/components/PostCard.tsx": "React component that displays a social media post card with image, author info, like/comment counts, and interactive buttons for liking, commenting, sharing, and deleting posts. Handles image loading states and uses React Query mutations for post interactions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for initial user profile setup that collects username, userId (with availability checking), bio, profile picture, and privacy settings. Prevents closing until profile is completed with valid data.",
  "frontend/src/components/ReelCard.tsx": "React component for displaying video reels with author info, like/comment functionality, video playback controls, and delete option for authors. Supports clicking author to view their profile and includes comment input interface.",
  "frontend/src/components/SharePostDialog.tsx": "Dialog component that allows users to share a post with their friends by selecting from a scrollable friend list and optionally adding a message. Displays post preview and friend avatars.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useNotificationPolling.ts": "Custom hook that polls for unseen notifications, tracks which notifications have been displayed, and provides functionality to dismiss popup notifications while preventing duplicates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, posts, reels, messages, friend requests, notifications, and search functionality. Provides both query hooks for fetching data and mutation hooks for creating/updating/deleting resources with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components including primary, secondary, accent, destructive, and chart colors using HSL values.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/ChatPage.tsx": "Real-time messaging interface allowing users to select friends, send text/photo/video messages, edit/delete messages, and view conversation history with auto-refresh polling. Handles media uploads with progress tracking and displays friend profiles with avatars.",
  "frontend/src/pages/FeedPage.tsx": "Displays a scrollable feed of all posts with auto-refresh every 30 seconds, includes create post button and refresh control. Shows error state when backend features are unavailable and empty state when no posts exist.",
  "frontend/src/pages/FriendsPage.tsx": "Manages friend relationships with tabs for friends list, incoming/outgoing requests, and user search. Provides functionality to add/remove friends, accept/decline requests, and view user profiles with privacy indicators.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Fabegram branding that provides Internet Identity authentication via a single sign-in button with loading state.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with avatar, bio, public/private status, post/reel counts, and tabs for viewing their posts and reels. Includes edit profile and delete account dialogs.",
  "frontend/src/pages/ReelsPage.tsx": "Displays a feed of all reels with auto-refresh every 30 seconds, a create reel button, and manual refresh functionality. Shows error alerts if the backend feature is unavailable.",
  "frontend/src/pages/UserProfilePage.tsx": "Displays another user's profile page with friendship management (send/cancel/accept requests, remove friend), showing posts and reels based on privacy settings and friendship status. Supports navigation via principal or userId.",
  "frontend/src/types/backend-types.ts": "Defines TypeScript interfaces for backend data structures including UserProfile, Post, Reel, Comment, Message, Notification, and related enums for message status and notification types.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking critical regressions in chat UI (multiple friends not showing) and feed display (post photos missing, only captions visible). Contains existing features for friend management, chat, posts, and account deletion with known issues documented."
}