{
  "backend/main.mo": "Defines social media data types and manages user profiles, posts, reels, comments, likes, messages, and notifications with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files across the project.",
  "frontend/index.html": "Base HTML file that loads the React application and sets metadata, favicon, and root mount point.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile loading, fallback flows, and layout rendering based on user state.",
  "frontend/src/components/CreatePostDialog.tsx": "Dialog component for creating posts with image upload, preview, progress tracking, and caption input.",
  "frontend/src/components/CreateReelDialog.tsx": "Dialog component for creating short video reels with upload, duration validation, preview, progress, and caption support.",
  "frontend/src/components/DeleteAccountDialog.tsx": "A confirmation dialog that requires typing DELETE before calling useDeleteAccount to permanently remove the user account.",
  "frontend/src/components/EditProfileDialog.tsx": "A profile editing dialog allowing users to update username, bio, avatar, and visibility, then submit changes via useUpdateProfile.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing tabs, notifications, theme toggle, and user avatar, with logic for refreshing data and marking notifications read.",
  "frontend/src/components/MainLayout.tsx": "Manages main app navigation and view state, handling tab changes, profile/chat navigation, and reacting to notifications.",
  "frontend/src/components/NotificationPopup.tsx": "Displays animated popup notifications and a container for stacking them, with click and auto-dismiss behavior.",
  "frontend/src/components/PostCard.tsx": "Displays a feed post with likes, comments, sharing, and delete actions, using various query hooks for post data. Handles user interactions such as liking, commenting, and viewing profiles.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating a user profile with username, userId, bio, avatar upload, and public/private setting. Validates userId availability and submits profile data via a mutation.",
  "frontend/src/components/ReelCard.tsx": "Displays a video reel with like, comment, and delete actions, plus video playback control. Fetches reel data through hooks and allows profile navigation.",
  "frontend/src/components/SharePostDialog.tsx": "Dialog for sharing a post with friends, including preview, optional message, and friend selection. Uses query hooks to fetch friends and a mutation to send shares.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, reinitializing on identity changes and invalidating related queries. Supports authenticated and anonymous actors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, identity restoration, and auth client setup. Exposes identity state and status flags to the app.",
  "frontend/src/hooks/useNotificationPolling.ts": "Polls unseen notifications, filters new ones, and manages a list of up to three popup notifications with dismiss and clear functions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, posts, messages, friends, and notifications through backend actor methods with error handling.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, applying global background and text styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ChatPage.tsx": "Implements a chat interface with friend selection, messaging, media sharing, shared post previews, and editing or deleting messages.",
  "frontend/src/pages/FeedPage.tsx": "Displays the posts feed with refresh and create-post actions, periodically refetching data and handling backend unavailability.",
  "frontend/src/pages/FriendsPage.tsx": "Manages friends, pending requests, searching, sending or removing requests, and viewing friend profiles.",
  "frontend/src/pages/LoginPage.tsx": "Shows a styled login screen allowing users to authenticate via Internet Identity.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the logged‑in user's profile with avatar, bio, privacy status, posts, reels, and edit/delete dialogs. Fetches user data and displays loading and empty states.",
  "frontend/src/pages/ReelsPage.tsx": "Displays a feed of all reels with auto-refresh, error handling, and a dialog to create new reels. Allows viewing profiles and refreshing reel data.",
  "frontend/src/pages/UserProfilePage.tsx": "Shows another user's profile with posts and reels, applying privacy and friendship logic. Supports friend requests, removal, cancellation, and back navigation.",
  "frontend/src/types/backend-types.ts": "Defines TypeScript interfaces for backend entities like profiles, posts, reels, messages, and notifications. Also includes enums for message and notification types.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, supporting both standard and hash-based routing. Also includes utilities for persisting parameters across sessions.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, known issues, architectural notes, existing features, and new feature requests focused on fixing account deletion and user search."
}