{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix chat UI friend list and feed post image display",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Fix the ChatPage friend list sidebar to correctly display all friends for chat selection",
      "acceptanceCriteria": [
        "All confirmed friends appear in the chat sidebar friend list",
        "Users can click on any friend to open a chat conversation",
        "The friend list updates when friendships are added or removed",
        "Empty state displays appropriately when user has no friends"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Fix the friend list rendering logic in the sidebar by ensuring the useGetFriendsList query data is properly mapped to display all friends. Update the friend list UI to show friend profiles with avatars and names, ensure click handlers properly set the selectedFriend state, add proper loading and error states for the friends query, and display an appropriate empty state when the user has no friends yet."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and verify the useGetFriendsList hook returns the correct data structure (Array<Principal>) and ensure it properly fetches all confirmed friends. Add error handling if the query fails and ensure the query is enabled only when the actor is available."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Fix the FeedPage PostCard component to properly display post images",
      "acceptanceCriteria": [
        "Post images render correctly in the feed when posts have images attached",
        "Image URLs are properly constructed from backend blob data",
        "Images display with appropriate dimensions and aspect ratios",
        "Posts without images still display captions correctly",
        "Loading states show while images are being fetched"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Fix the post image rendering by ensuring the ExternalBlob.getDirectURL() method is called correctly on post.image to generate the image URL. Verify the img element src attribute is set to this URL, add proper loading states with a skeleton or spinner while the image loads, handle image load errors gracefully with a fallback, and ensure the image container maintains proper aspect ratios using Tailwind classes. The ExternalBlob type from the blob-storage component provides the getDirectURL() method for streaming and caching support."
        }
      ]
    }
  ]
}